; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (next-num ?numA - num ?numB - num) 
    (in-carrier ?crate - crate ?carrier - carrier)
    (crates-in-carrier ?carrier - carrier ?n - num)
    (carrier-capacity ?carrier - carrier ?n - num)
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?n_current - num
        ?n_next - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_current ?n_next)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_next)
        (in-carrier ?crate ?carrier)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?person - person
        ?content - content 
        ?n_current - num
        ?n_prev - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (in-carrier ?crate ?carrier)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_prev ?n_current)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_prev)
        (not (in-carrier ?crate ?carrier))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l15_p15_c15_g15_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	carrier1 - carrier
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(carrier-at carrier1 depot)
	(carrier-capacity carrier1 N4)
	(crates-in-carrier carrier1 N0)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate medicine crate15)
	(person-at person1 loc9)
	(person-at person2 loc8)
	(person-at person3 loc1)
	(person-at person4 loc10)
	(person-at person5 loc2)
	(person-at person6 loc12)
	(person-at person7 loc7)
	(person-at person8 loc4)
	(person-at person9 loc5)
	(person-at person10 loc6)
	(person-at person11 loc15)
	(person-at person12 loc12)
	(person-at person13 loc8)
	(person-at person14 loc14)
	(person-at person15 loc15)
	(next-num N0 N1)
	(next-num N1 N2)
	(next-num N2 N3)
	(next-num N3 N4)
	(next-num N4 N5)
	(next-num N5 N6)
	(next-num N6 N7)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person14 food)
	(has-content-person person15 food)
))
)

; plan
1. (put-crate-in-carrier crate15 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate15 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate15 carrier1)
   goals met: 1 of 16
2. (put-crate-in-carrier crate14 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate14 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate14 carrier1)
   goals met: 1 of 16
3. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 0 of 16
4. (pick-and-drop crate15 loc12 drone1 carrier1 person6 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate15 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person6 medicine)
   goals met: 1 of 16
5. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 16
6. (put-crate-in-carrier crate13 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate13 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate13 carrier1)
   goals met: 2 of 16
7. (move-carrier depot loc15 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   goals met: 1 of 16
8. (pick-and-drop crate13 loc15 drone1 carrier1 person11 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate13 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person11 food)
   goals met: 2 of 16
9. (move-carrier loc15 depot drone1 carrier1)
   deleted: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 16
10. (put-crate-in-carrier crate12 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate12 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate12 carrier1)
   goals met: 3 of 16
11. (move-carrier depot loc15 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   goals met: 2 of 16
12. (pick-and-drop crate12 loc15 drone1 carrier1 person15 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate12 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person15 food)
   goals met: 3 of 16
13. (move-carrier loc15 depot drone1 carrier1)
   deleted: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 16
14. (put-crate-in-carrier crate11 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate11 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate11 carrier1)
   goals met: 4 of 16
15. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 3 of 16
16. (pick-and-drop crate11 loc14 drone1 carrier1 person14 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate11 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person14 food)
   goals met: 4 of 16
17. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 16
18. (put-crate-in-carrier crate10 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate10 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate10 carrier1)
   goals met: 5 of 16
19. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 4 of 16
20. (pick-and-drop crate10 loc12 drone1 carrier1 person6 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate10 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person6 food)
   goals met: 5 of 16
21. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 16
22. (put-crate-in-carrier crate9 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate9 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate9 carrier1)
   goals met: 6 of 16
23. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 5 of 16
24. (pick-and-drop crate9 loc12 drone1 carrier1 person12 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate9 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person12 food)
   goals met: 6 of 16
25. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 16
26. (put-crate-in-carrier crate8 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate8 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   goals met: 7 of 16
27. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 6 of 16
28. (pick-and-drop crate8 loc10 drone1 carrier1 person4 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person4 food)
   goals met: 7 of 16
29. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 16
30. (put-crate-in-carrier crate7 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate7 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   goals met: 8 of 16
31. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 7 of 16
32. (pick-and-drop crate7 loc9 drone1 carrier1 person1 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person1 food)
   goals met: 8 of 16
33. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 16
34. (put-crate-in-carrier crate6 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate6 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate6 carrier1)
   goals met: 9 of 16
35. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 8 of 16
36. (pick-and-drop crate6 loc8 drone1 carrier1 person2 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate6 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person2 food)
   goals met: 9 of 16
37. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 16
38. (put-crate-in-carrier crate5 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate5 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate5 carrier1)
   goals met: 10 of 16
39. (move-carrier depot loc7 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 9 of 16
40. (pick-and-drop crate5 loc7 drone1 carrier1 person7 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate5 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person7 food)
   goals met: 10 of 16
41. (move-carrier loc7 depot drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 16
42. (put-crate-in-carrier crate4 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate4 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate4 carrier1)
   goals met: 11 of 16
43. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 10 of 16
44. (pick-and-drop crate4 loc6 drone1 carrier1 person10 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate4 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person10 food)
   goals met: 11 of 16
45. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 12 of 16
46. (put-crate-in-carrier crate3 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate3 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate3 carrier1)
   goals met: 12 of 16
47. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 11 of 16
48. (pick-and-drop crate3 loc5 drone1 carrier1 person9 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate3 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person9 food)
   goals met: 12 of 16
49. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 13 of 16
50. (put-crate-in-carrier crate2 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate2 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate2 carrier1)
   goals met: 13 of 16
51. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 12 of 16
52. (pick-and-drop crate2 loc4 drone1 carrier1 person8 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate2 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person8 food)
   goals met: 13 of 16
53. (move-carrier loc4 loc2 drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 13 of 16
54. (pick-and-drop crate14 loc2 drone1 carrier1 person5 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate14 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person5 food)
   goals met: 14 of 16
55. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 16
56. (put-crate-in-carrier crate1 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate1 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   goals met: 15 of 16
57. (move-carrier depot loc1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 14 of 16
58. (pick-and-drop crate1 loc1 drone1 carrier1 person3 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person3 food)
   goals met: 15 of 16
59. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 16 of 16
